data segment
	max dw ?
	mass dw 1,2,3,4,-10,6,-1,7,1,9
data ends

code segment
	assume cs: code, ds: data

start:
	mov ax, data ; загружаем адрес сегмента данных в регистр ax
	mov ds, ax ; установка сегмента данных равного адресу из ax
	lea bx, mass ; загрузка адреса начала массива чисел в регистр bx
	mov cx, 10 ; инициализация счетчика цикла количеством элементов в массиве 10
	mov ax, [bx] ; загрузка первого числа из массива в регистр
	xor dl,dl ; обнуление регистра dl, который будет использоваться для подсчета отрицательных чисел
beg: 
	cmp byte [bx], 0 ; сравнение текущего элемента массива с нулем
	jnl no ; если текущий элемент не отрицателньый переходим к метке no
	inc dl ; увеличение счетчика отрицательных чисел
	cmp [bx], ax  ; сравнение текущего элемента с максимально найднем отриц числов (хранится в ax)
	jge no ; если текущий элемент больше или равен максимальному найденом, то идем к метке no
	mov ax, [bx] ; перенос значения в ax их bx
no:
	add bx, 2 ; переходим к следующему элементу массива
	loop beg ; выполнение цикла снова
	cmp dl, 0 ; сравнение счетчика отрицательных чисел с нулем
	jz quit ; если отриц. чисел не было найдено - завершение программы
	mov max, ax ; сохранение значения в max
quit:
	mov ax,4C00h 
	int 21h 
code ends
end start