from labs.lab01 import *
from labs.lab02 import *
from labs.lab03 import *
from labs.lab04 import *
from labs.lab05 import *
from labs.lab07 import *
from labs.lab08 import *
from labs.lab09 import *
from labs.lab10 import *
from labs.lab11 import *
from labs.lab12 import *
from labs.lab13 import *
from labs.lab14 import *

try:
    # noinspection PyShadowingNames,PyGlobalUndefined
    def get_condition(selected_module, selected_function):
        global text
        if selected_module == 'Лабораторная 1':
            if selected_function == 'Задача 1':
                text = 'Напишите программу для решения примера (по вариантам).' \
                       'Предусмотрите проверку деления на ноль. Все необходимые переменные пользователь вводит через консоль.' \
                       'Запись |пример| означает «взять по модулю», т.е. если значение получится отрицательным,' \
                       'необходимо сменить знак с минуса на плюс.\n--------------------------------------------------------\n' \
                       '|1 - a*bc - a*(b2-c2) + (b-c+a)*(12+b)/(c-a)|'
            elif selected_function == 'Задача 2':
                text = 'Дан произвольный список, содержащий и строки и числа.\nВыведите все четные элементы в одной строке.'
            elif selected_function == 'Задача 3':
                text = 'Дан произвольный список, содержащий только числа.\nВыведите результат умножения всех чисел меньше 10.'
            elif selected_function == 'Задача 4':
                text = 'Дан произвольный список, содержащий только числа.\nВыведите среднее арифметическое (сумма всех чисел, деленная на количество элементов).'
            else:
                text = "Задача не найдена"
        if selected_module == 'Лабораторная 2':
            if selected_function == 'Задача 1':
                text = 'Пусть задано некоторое число my_number (19).' \
                       '\nПользователь вводит с клавиатуры свое число user_number' \
                       '\nЗапрашивайте у пользователя вводить число user_number если оно равно my_number.'
            elif selected_function == 'Задача 2':
                text = 'Пусть задан список, содержащий строки' \
                       '\nВыведите все строки, заканчивающиеся буковой r.'
            elif selected_function == 'Задача 3':
                text = 'Сгенерируйте и выведите:\n' \
                       'Случайную строку размером 6 символов, содержащую только цифры. Строка должна содержать хотя бы одну цифру 3.\n' \
                       'Ввод ничего не дает :)'
            elif selected_function == 'Задача 4':
                text = 'Пусть дана строка. На основе данной строки сформируйте новую,\n' \
                       'содержащую только буквы Л. Выведите новую строку.).'
            else:
                text = "Задача не найдена"
        if selected_module == 'Лабораторная 3':
            if selected_function == 'Задача 1':
                text = 'Пусть дана строка, состоящая из слов, пробелов и знаков препинания.' \
                       '\nНа основании этой строки создайте новую (и выведите ее на консоль)' \
                       '\nСодержащую только слова размером от 5 до 10 символов.'
            elif selected_function == 'Задача 2':
                text = 'Пусть дана строковая переменная, содержащая информацию о студентах:' \
                       '\nmy_string = «Ф;И;О;Возраст;Категория;_Иванов;Иван;Иванович;22 года;Студент 3 курса;_Петров;Семен;Игоревич;22 года;Студент 2 курса»' \
                       '\nВыведите информацию в виде:' \
                       '\n  Ф      И     О            О студенте' \
                       '\nИванов Иван Иванович Студент 3 курса, 23 года' \
                       '\nПетров Семен Игоревич Студент 2 курса, 22 года' \
                       '\n P.S. Вводить ничего не нужно :)'
            elif selected_function == 'Задача 3':
                text = 'Пусть дана строковая переменная, содержащая информацию о студентах вида:' \
                       'my_string = «ФИО;Возраст;Категория;_Иванов Иван Иванович;23 года;Студент 3 курса;_Петров Семен Игоревич;22 года;' \
                       'Студент 2 курса;_Иванов Семен Игоревич;22 года;Студент 2 курса;_Акибов Ярослав Наумович;' \
                       '23 года;Студент 3 курса;_Борков Станислав Максимович;21 год;Студент 1 курса;_Петров Семен Семенович;21 год;' \
                       'Студент 1 курса;_Романов Станислав Андреевич;23 года;Студент 3 курса;' \
                       '_Петров Всеволод Борисович;21 год;Студент 2 курса».' \
                       'Выведите построчно информацию о студентах, чей возраст больше «21 года».' \
                       'P.S. Вводить ничего не нужно :)'
            elif selected_function == 'Задача 4':
                text = 'Пусть дана строка произвольной длины. Выведите информацию о том, сколько в ней символов и сколько слов.'
            else:
                text = "Задача не найдена"
        if selected_module == 'Лабораторная 4':
            if selected_function == 'Задача 1':
                text = 'Пусть дана матрица чисел размером NхN. Представьте данную матрицу в виде списка. Выведите результат сложения всех элементов матрицы.'

            elif selected_function == 'Задача 2':
                text = 'Пусть дан список из 10 элементов\n' \
                       'Удалите элементы с 4 по 8 и добавьте 2 новых. Выведите список на экран.\n' \
                       'В поле ввода напишите два целых числа через пробел'
            elif selected_function == 'Задача 3':
                text = 'Пусть журнал по предмету «Информационные технологии» представлен в виде списка: my_len = [[‘БО-331101’,[‘Акулова Алена’, ‘Бабушкина Ксения’, …….]],[‘ БОВ-421102’,[…..]],[‘ БО-331103’,[….]]].\n' \
                       'Выведите списки всех групп построчно в виде:\n' \
                       '<Название группы>\n' \
                       '      <ФИО>\n' \
                       '      <ФИО>\n' \
                       'Ничего вводить не нужно :)'
            elif selected_function == 'Задача 4':
                text = 'Пусть журнал по предмету «Информационные технологии» представлен в виде списка: my_len = [[‘БО-331101’,[‘Акулова Алена’, ‘Бабушкина Ксения’, …….]],[‘ БОВ-421102’,[…..]],[‘ БО-331103’,[….]]].\n' \
                       'Выведите всех студентов (и их группы), чья фамилия начинается на букву «П», а имя на букву «А».\n' \
                       'Ничего вводить не нужно :)'
        if selected_module == 'Лабораторная 5':
            if selected_function == 'Задача 1':
                text = (
                    'Пусть дана некоторая директория (папка). Посчитайте количество файлов в данной директории (папке) и выведите на экран\n'
                    r'# C:\Users\5555k\PycharmProjects\GUI_MY'
                    '\n P.S. Вводить ничего не нужно')
            elif selected_function == 'Задача 2':
                text = 'Пусть дан файл students.csv, в котором содержится информация о студентах в виде:\n' \
                       '№;ФИО;Возраст;Группа\n' \
                       '1;Иванов Иван Иванович;23;БО-111111\n' \
                       '2;Сидоров Семен Семенович;23;БО-111111\n' \
                       '3;Яшков Илья Петрович;24;БО-222222.\n' \
                       'Выведите информацию о студентах, отсортировав их по номеру группы.' \
                       '\n P.S. Вводить ничего не нужно'
            elif selected_function == 'Задача 3':
                text = 'Из задания 2: По увеличению возраста студентов в заданной пользователем группе на 1' \
                       '\nВведите номер группы в виде: БО - 111111'
            elif selected_function == 'Задача 4':
                text = 'Добавьте к пользовательскому интерфейсу из задачи №3 возможность сохранения новых данных обратно в файл' \
                       '\nВведите номер группы в виде: БО - 111111'
            else:
                text = "Задача не найдена"
        if selected_module == 'Лабораторная 6':
            if selected_function == 'Задача 1':
                text = 'Реализуйте задания предыдущих лабораторных работ (выполненные согласно вашему варианту) в виде пользовательских функций.' \
                       '\n P.S. Вводить ничего не нужно'
            elif selected_function == 'Задача 2':
                text = 'Реализуйте единое пользовательское меню выбора соответствующих функций из задания №1 в виде:' \
                       '\n0 – Выход из программы' \
                       '\n1 – Название функции №1.' \
                       '\n2 – Название функции №2.' \
                       '\n3 – …' \
                       '\nПосле выполнения каждой из функций запрашивайте у пользователя' \
                       '\n«Вы хотите продолжить?» Если ответ «да» (yes, Y, 1), то снова выводите меню.' \
                       '\nЕсли ответ «нет» (no, N, 0), то завершите программу' \
                       '\n P.S. Вводить ничего не нужно'
            else:
                text = "Задача не найдена"
        if selected_module == 'Лабораторная 7':
            if selected_function == 'Задача 1':
                text = 'Пусть дан словарь. Посчитайте и выведите сколько в словаре ключей'
            elif selected_function == 'Задача 2':
                text = 'Пусть дан файл students.csv, в котором содержится информация о студентах в виде:' \
                       '\n№;ФИО;Возраст;Группа' \
                       '\n1;Иванов Иван Иванович;23;БО-111111' \
                       '\n2;Сидоров Семен Семенович;23;БО-111111' \
                       '\n3;Яшков Илья Петрович;24;БО-222222' \
                       '\n...' \
                       '\nСчитайте информацию из файла в структуру: {№: [ФИО, Возраст, Группа], №: [....], №: [....]} (словарь, где ключи – это порядковые номера студентов)' \
                       '\nВыведите информацию о студентах, отсортировав их по номеру группы.'
            elif selected_function == 'Задача 3':
                text = 'Добавьте к задаче №2 возможность' \
                       '\nУвеличить возраст студентов в заданной пользователем группе на 1.'
            elif selected_function == 'Задача 4':
                text = 'Добавьте к пользовательскому интерфейсу из задачи №3 возможность сохранения новых данных в файл.\n' \
                       'P.S. Для этого есть кнопка сохранения'
            else:
                text = "Задача не найдена"
        if selected_module == 'Лабораторная 8':
            if selected_function == 'Задача 1':
                text = 'Пусть список студентов представлен в виде структуры [[№, ФИО, Возраст, Группа],[№, ФИО, Возраст, Группа],[№, ФИО, Возраст, Группа]].' \
                       '\nПреобразуйте список в словарь вида: {№: [ФИО, Возраст, Группа], №:[....], №: [....]}'
            elif selected_function == 'Задача 2':
                text = 'Добавьте к задаче №1 для словаря возможность (без преобразования словаря обратно в список):' \
                       '\n[1].Увеличить возраст конкретного студента на 1. Поиск по «ФИО»;(«ФИО» студента необходимо ввести с клавиатуры).' \
                       '\n[2].Изменить «ФИО» студента. Поиск по «ФИО» (старое и новое «ФИО» студента необходимо ввести с клавиатуры)' \
                       '\n[3].Увеличить возраст конкретного студента на 1. Поиск по «№» («№» студента необходимо ввести с клавиатуры).' \
                       '\n[4].Изменить группу студента. Поиск по «ФИО» («ФИО» студента и новый номер группы необходимо ввести с клавиатуры).' \
                       '\n[5].Удалить запись о студенте. Поиск по «№» («№» студента, которого нужно удалить из списка, задается с клавиатуры)' \
                       '\n[6].Если возраст студента больше 22 уменьшить его на 1.' \
                       '\n[7].Если возраст студента равен 23, удалить его из списка.' \
                       '\n[8].У всех студентов с фамилией «Иванов» увеличить возраст на 1.' \
                       '\n[9].У студентов с фамилией «Иванов» изменить фамилию на «Сидоров».' \
                       '\n[10].Поменять «ФИО» и «Группа» местами.\n\n' \
                       'ПРИМЕР ВВОДА ДЛЯ КАЖДОГО ПУНКТА 1-5:\n' \
                       '[1] <Фамилия> <Имя>\n' \
                       '[2] <Фамилия1> <Имя1> <Фамилия2> <Имя2>\n' \
                       '[3] <№ студента>\n' \
                       '[4] <Фамилия> <Имя> <Номер Новой Группы>\n' \
                       '[5] <№ студента>\n' \
                       'В остальных: [x]'
            elif selected_function == 'Задача 3':
                text = 'Добавьте к пользовательскому интерфейсу из задачи №2 возможность вывода из словаря (без его преобразования в список):' \
                       '\n[1]. Списка студентов (а также информацию о них) группы БО-111111.' \
                       '\n[2]. Списка студентов (а также информацию о них) с номерами 1-10.' \
                       '\n[3]. Списка студентов (а также информацию о них) в возрасте 22 лет.' \
                       '\n[4]. Список студентов (а также информацию о них) с фамилией Иванов.' \
                       '\n[5]. Списка студентов (а также информацию о них), чьи фамилии заканчиваются на «а».' \
                       '\n[6]. Списка студентов (а также информацию о них), чей возраст – четное число.' \
                       '\n[7]. Списка студентов (а также информацию о них), если в возрасте студента встречается число 5.' \
                       '\n[8]. Списка студентов (а также информацию о них), если их номера группы длиннее 7 символов.' \
                       '\n[9]. Списка студентов (а также информацию о них), если их «№» четное число.' \
                       '\n[10].Списка студентов (а также информацию о них), если их номер группы заканчивается на «1».'
            else:
                text = "Задача не найдена"
        if selected_module == 'Лабораторная 9':
            if selected_function == 'Задача 1':
                text = 'Пусть список студентов представлен в виде структуры' \
                       '\n{№: [ФИО, Возраст, Группа], №: [....], №: [....]}.' \
                       '\nРеализуйте функционал по добавлению нового студента (данные вводятся через консоль).' \
                       '\nPRIMER: 101 kirito tutalov 45 VKB - 21'
            elif selected_function == 'Задача 2':
                text = 'Пусть список студентов представлен в виде структуры' \
                       '\n{№: [ФИО, Возраст, Группа], №: [....], №: [....]}.' \
                       '\nРеализуйте функционал по изменению всех данных о студенте (поиск по «№»)' \
                       '\nPRIMER: 101 kirito tutalov 45 VKB - 21'
            elif selected_function == 'Задача 3':
                text = 'Пусть список студентов представлен в виде структуры' \
                       '\n{№: [ФИО, Возраст, Группа], №: [....], №: [....]}.' \
                       '\nРеализуйте функционал по удалению данных о студенте (поиск по «№»)' \
                       '\nPRIMER: 2'
            elif selected_function == 'Задача 4':
                text = 'Пусть список студентов представлен в виде структуры' \
                       '\n{№: [ФИО, Возраст, Группа], №: [....], №: [....]}.' \
                       '\nВыведите информацию о студенте с конкретным «№» («№» задается через консоль)' \
                       '\nPRIMER: 2'
            else:
                text = "Задача не найдена"
        if selected_module == 'Лабораторная 10':
            matrix = '\nИсходная матрица:\n[1 2 3 4 5 6 7 8]\n[8 7 6 5 4 3 2 1]\n[2 3 4 5 6 7 8 9]\n[9 8 7 6 5 4 3 2]\n[1 3 5 7 9 7 5 3]\n[3 1 5 3 2 6 5 7]\n[1 7 5 9 7 3 1 5]\n[2 6 3 5 1 7 3 2]\n'
            if selected_function == 'Задача 1':
                text = 'Напишите функцию возведения в квадрат всех элементов меньше 5.' + matrix
            elif selected_function == 'Задача 2':
                text = 'Напишите функцию сложения по строкам четных элементов.' + matrix
            elif selected_function == 'Задача 3':
                text = 'Напишите функцию сложения по строкам четных элементов.' + matrix
            elif selected_function == 'Задача 4':
                text = 'Напишите функцию сложения всех элементов матрицы меньших 5' \
                       '\n(в одно число) и всех элементов матрицы больше или равных 5 (в другое число).' \
                       '\nСравните числа и выведите, какое из них больше.' + matrix
            elif selected_function == 'Задача 5':
                text = 'Напишите функцию возведения всех чисел 5 в квадрат' + matrix
            elif selected_function == 'Задача 6':
                text = 'Напишите функцию очистки матрицы.' + matrix
            elif selected_function == 'Задача 7':
                text = 'Напишите функцию, которая посчитает, сколько раз в матрице встречается число 3.' + matrix
            elif selected_function == 'Задача 8':
                text = 'Пусть пользователь через консоль вводит число: номер столбца.' \
                       '\nНапишите функцию, которая посчитает сумму элементов из данного столбца.' + matrix
        ###################################
        if selected_module == 'Лабораторная 11':
            if selected_function == 'Задача 1':
                text = 'Представьте таблицы (согласно вашему варианту) в виде структур языка Python.'
            elif selected_function == 'Задача 2':
                text = 'Реализуйте в консоли интерфейс по добавлению, удалению, изменению данных.\n' \
                       'Имейте ввиду, что связанные операции (удаление, добавление, изменение) для связанных таблиц,\n' \
                       'должны изменять данных во всех связанных структурах.\n' \
                       '#########################################################\n' \
                       '~ Удалить (преподавателя) ___\n' \
                       '~ Удалить всех с кафедры ___\n' \
                       '~ Удалить всех, кто имеет звание ___\n' \
                       '~ Добавить новое звание - ___\n' \
                       '~ Добавить новую кафедру в университет ___\n' \
                       '~ Добавить нового преподавателя ___ с возрастом ___ на кафедру ___ в университет ___ на должность ___\n' \
                       '~ Изменить имя преподавателя с ___ на ___\n' \
                       '~ Изменить название кафедры с ___ на ___'
            elif selected_function == 'Задача 3':
                text = ('Выведите следующую информацию в консоль построчно:'
                        'Для каждого преподавателя: «ФИО преподавателя», «название кафедры», «должность преподавателя».')
            elif selected_function == 'Задача 4':
                text = 'Посчитайте и выведите результат: Для каждой кафедры: сколько всего преподавателей.'
            elif selected_function == 'Задача 5':
                text = (
                    'Реализуйте функционал по сохранению данных в файлы формата .csv исчитыванию информации из файлов\n'
                    '~ (Записать|Вписать)(данные|информацию)?\n'
                    '~ (Считать|Прочитать)(данные|информацию)')
        if selected_module == 'Лабораторная 12':
            if selected_function == 'Задача 1':
                text = (
                    'Пусть дана база данных (приведена ниже). Используйте нужные структуры данных для ее хранения.\n'
                    'Заполните БД. Выведите все страны, чье название начинается на букву А')
            elif selected_function == 'Задача 2':
                text = 'Для БД из задания 1, выведите все улицы, которые встречаются более чем в 5 городах'
            elif selected_function == 'Задача 3':
                text = 'Для БД из задания 6 выведите все улицы, для страны «РФ».'
            elif selected_function == 'Extra':
                text = 'Отображение базы данных в виде словаря'
        if selected_module == 'Лабораторная 13':
            if selected_function == 'Задача 1':
                text = 'Написать регулярное выражение, определяющее является ли данная строка строкой "abcdefghijklmnopqrstuv18340" или нет.\n' \
                       '– пример правильных выражений: abcdefghijklmnopqrstuv18340\n' \
                       '– пример неправильных выражений: abcdefghijklmnoasdfasdpqrstuv18340'
            elif selected_function == 'Задача 2':
                text = 'Написать регулярное выражение, определяющее является ли данная строка GUID с или без скобок.\n' \
                       'Где GUID это строчка, состоящая из 8, 4, 4, 4, 12 шестнадцатеричных цифр разделенных тире.\n' \
                       '– пример правильных выражений: e02fd0e4-00fd-090A-ca30-0d00a0038ba0.\n' \
                       '– пример неправильных выражений: e02fd0e400fd090Aca300d00a0038ba0.'
            elif selected_function == 'Задача 3':
                text = 'Написать регулярное выражение, определяющее является ли заданная строка правильным MAC-адресом.\n' \
                       '– пример правильных выражений: aE:dC:cA:56:76:54.\n' \
                       '– пример неправильных выражений: 01:23:45:67:89:Az.'
            elif selected_function == 'Задача 4':
                text = 'Написать регулярное выражение, определяющее является ли данная строчка валидным URL адресом.\n' \
                       'В данной задаче правильным URL считаются адреса http и https, явное указание протокола также может отсутствовать.\n' \
                       'Учитываются только адреса, состоящие из символов, т.е. IP адреса в качестве URL не присутствуют при проверке.\n' \
                       'Допускаются поддомены, указание порта доступа через двоеточие, GET запросы с передачей параметров, доступ\n' \
                       'к подпапкам на домене, допускается наличие якоря через решетку. Однобуквенные домены считаются запрещенными.\n' \
                       'Запрещены спецсимволы, например «–» в начале и конце имени домена. Запрещен символ «_» и пробел в имени домена.\n' \
                       'При составлении регулярного выражения ориентируйтесь на список правильных и неправильных выражений заданных ниже.\n' \
                       '– пример правильных выражений: https://www.example.com,https:///example.com.\n' \
                       '– пример неправильных выражений: Just Text, https://a.com.'
            elif selected_function == 'Задача 5':
                text = 'Написать регулярное выражение, определяющее является ли данная строчка шестнадцатиричным\n' \
                       'идентификатором цвета в HTML. Где #FFFFFF для белого, #000000 для черного, #FF0000 для красного и т.д.\n' \
                       '– пример правильных выражений: #FFFFFF, #FF3421, #00ff00.\n' \
                       '– пример неправильных выражений: 232323, f#fddee, #fd2.'
            elif selected_function == 'Задача 6':
                text = 'Написать регулярное выражение, определяющее является ли данная строчка датой в формате dd/mm/yyyy.\n' \
                       'Начиная с 1600 года до 9999 года.\n' \
                       '– пример правильных выражений: 29/02/2000, 30/04/2003, 01/01/2003.\n' \
                       '– пример неправильных выражений: 29/02/2001, 30-04-2003, 1/1/1899.'
            elif selected_function == 'Задача 7':
                text = 'Написать регулярное выражение, определяющее является ли данная строчка валидным E-mail\n' \
                       'адресом согласно RFC под номером 2822.\n' \
                       '– пример правильных выражений: user@example.com, root@localhost\n' \
                       '– пример неправильных выражений: bug@@@com.ru, @val.ru, Just Text2.'
            elif selected_function == 'Задача 8':
                text = 'Составить регулярное выражение, определяющее является ли заданная строка IP адресом, записанным в десятичном виде.\n' \
                       '– пример правильных выражений: 127.0.0.1, 255.255.255.0.\n' \
                       '– пример неправильных выражений: 1300.6.7.8, abc.def.gha.bcd.'
            elif selected_function == 'Задача 9':
                text = 'Проверить, надежно ли составлен пароль. Пароль считается надежным, если он состоит из 8 или более символов.\n' \
                       'Где символом может быть английская буква, цифра и знак подчеркивания. Пароль должен содержать хотя бы одну заглавную букву, одну маленькую букву и одну цифру.\n' \
                       '– пример правильных выражений: C00l_Pass, SupperPas1.\n' \
                       '– пример неправильных выражений: Cool_pass, C00l.'
            elif selected_function == 'Задача 10':
                text = 'Проверить является ли заданная строка шестизначным числом, записанным в десятичной системе счисления без нулей в старших разрядах.\n' \
                       '– пример правильных выражений: 123456, 234567.\n' \
                       '– пример неправильных выражений: 1234567, 12345.'
            elif selected_function == 'Задача 11':
                text = 'Есть текст со списками цен. Извлечь из него цены в USD, RUR, EU.\n' \
                       '– пример правильных выражений: 23.78 USD.\n' \
                       '– пример неправильных выражений: 22 UDD, 0.002 USD.'
            elif selected_function == 'Задача 12':
                text = 'Проверить существуют ли в тексте цифры, за которыми не стоит «+».\n' \
                       '– пример правильных выражений: (3 + 5) – 9 × 4.\n' \
                       '– пример неправильных выражений: 2 * 9 – 6 × 5.'
            elif selected_function == 'Задача 13':
                text = 'Создать запрос для вывода только правильно написанных выражений со скобками (количество открытых и закрытых скобок должно быть одинаково).\n' \
                       '– пример правильных выражений: (3 + 5) – 9 × 4.\n' \
                       '– пример неправильных выражений: ((3 + 5) – 9 × 4.'
        if selected_module == 'Лабораторная 14':
            if selected_function == 'Задача 1':
                text = ('Создать класс Student, содержащий поля: фамилия и инициалы, номер группы, успеваемость\n'
                        '(массив из пяти элементов). Создать массив из десяти элементов такого типа, упорядочить\n'
                        'записи по возрастанию среднего балла. Добавить возможность вывода фамилий и номеров групп\n'
                        'студентов, имеющих оценки, равные только 4 или 5.\n'
                        '###########################################################################################\n'
                        '>> Вывести всех студентов имеющих только оценки 4 или 5')
            if selected_function == 'Задача 2':
                text = ('Создать класс с именем Train, содержащий поля: название пункта назначения, номер поезда,\n'
                        'время отправления. Ввести данные в массив из пяти элементов типа train, упорядочить элементы\n'
                        'по номерам поездов. Добавить возможность вывода информации о поезде, номер которого введен\n'
                        'пользователем. Добавить возможность сортировки массива по пункту назначения, причем поезда\n'
                        'с одинаковыми пунктами назначения должны быть упорядочены по времени отправления.\n'
                        '#############################################################################################\n'
                        '>> Вывести информацию о поезде под номером ___\n'
                        '>> Отсортировать поезда по пункту назначения|Отсортировать\n'
                        '>> Вывести всю таблицу расписания поездов')
            if selected_function == 'Задача 3':
                text = ('Создать класс с двумя переменными. Добавить функцию вывода на экран и функцию изменения этих\n'
                        'переменных. Добавить функцию, которая находит сумму значений этих переменных, и функцию которая\n'
                        'находит наибольшее значение из этих двух переменных.\n'
                        '###############################################################################################\n'
                        '>> Найти сумму значений (переменных) ___ ___\n'
                        '>> Найти наибольшее значение ___ ___\n'
                        '>> Изменить переменные с ___ ___ на ___ ___')
            if selected_function == 'Задача 4':
                text = ('Класс «Домашняя библиотека». Предусмотреть возможность работы с произвольным числом книг,\n'
                        'поиска книги по какому-либо признаку (например, по автору или по году издания), добавления книг\n'
                        'в библиотеку, удаления книг из нее, сортировки книг по разным полям.\n'
                        '################################################################################################\n'
                        '>> Добавить книгу ___\n'
                        '>> Удалить книгу ___\n'
                        '>> Найти книгу по автору - ___\n'
                        '>> Найти книгу по названию - ___\n'
                        '>> Найти книгу по году - ___\n'
                        '>> Отсортировать книги по годам\n'
                        '>> Отсортировать книги по авторам\n'
                        '>> Отсортировать книги по названиям')
            if selected_function == 'Задача 5':
                text = ('Класс Покупатель: Фамилия, Имя, Отчество, Адрес, Номер кредитной карточки, Номер банковского счета;\n'
                        'Методы: установка значений атрибутов, получение значений атрибутов, вывод информации.\n'
                        'Создать массив объектов данного класса. Вывести список покупателей в алфавитном порядке и список\n'
                        'покупателей, у которых номер кредитной карточки находится в заданном диапазоне.\n'
                        '##############################################################################################\n'
                        '>> Вывести список покупателей в алфавитном порядке\n'
                        '>> Вывести список покупателей, у которых номер кредитной карточки находится в диапазоне от ___ до ___')
            if selected_function == 'Задача 6':
                text = ('Класс Абонент: Идентификационный номер, Фамилия, Имя, Отчество, Адрес, Номер кредитной карточки,\n'
                        'Дебет, Кредит, Время междугородных и городских переговоров; Конструктор;\n'
                        'Методы: установка значений атрибутов, получение значений атрибутов, вывод информации.\n'
                        'Создать массив объектов данного класса. Вывести сведения относительно абонентов, у которых время\n'
                        'городских переговоров превышает заданное.  Сведения относительно абонентов, которые пользовались\n'
                        'междугородной связью. Список абонентов в алфавитном порядке.\n'
                        '###############################################################################################\n'
                        '>> Вывести сведения относительно абонентов, у которых время превышает __:__:__\n'
                        '>> Вывести сведения относительно абонентов, которые пользовались междугородной связью\n'
                        '>> Вывести список абонентов в алфавитном порядке')
        return text


    # noinspection PyShadowingNames
    def selection_def(selected_module, selected_function, text):
        if selected_module == 'Лабораторная 1':
            if selected_function == 'Задача 1':
                return lab1_1(text)
            elif selected_function == 'Задача 2':
                return lab1_2(text)
            elif selected_function == 'Задача 3':
                return lab1_3(text)
            elif selected_function == 'Задача 4':
                return lab1_4(text)
        if selected_module == "Лабораторная 2":
            if selected_function == 'Задача 1':
                return lab2_1(text)
            elif selected_function == 'Задача 2':
                return lab2_2(text)
            elif selected_function == 'Задача 3':
                return lab2_3()
            elif selected_function == 'Задача 4':
                return lab2_4(text)
        if selected_module == "Лабораторная 3":
            if selected_function == 'Задача 1':
                return lab3_1(text)
            elif selected_function == 'Задача 2':
                return lab3_2()
            elif selected_function == 'Задача 3':
                return lab3_3()
            elif selected_function == 'Задача 4':
                return lab3_4(text)
        if selected_module == "Лабораторная 4":
            if selected_function == 'Задача 1':
                return lab4_1(text)
            elif selected_function == 'Задача 2':
                return lab4_2(text)
            elif selected_function == 'Задача 3':
                return lab4_3()
            elif selected_function == 'Задача 4':
                return lab4_4()
        if selected_module == "Лабораторная 5":
            if selected_function == 'Задача 1':
                return lab5_1(text)
            elif selected_function == 'Задача 2':
                return lab5_2()
            elif selected_function == 'Задача 3':
                return lab5_3(text, flag=0)
            elif selected_function == 'Задача 4':
                return lab5_4(text)
        if selected_module == "Лабораторная 6":
            return "Тут ничего не должно быть :)"
        if selected_module == "Лабораторная 7":
            if selected_function == 'Задача 1':
                return lab7_1()
            elif selected_function == 'Задача 2':
                return lab7_2(0)
            elif selected_function == 'Задача 3':
                return lab7_3(text, 0)
        if selected_module == "Лабораторная 8":
            if selected_function == 'Задача 1':
                return lab8_1(0)
            elif selected_function == 'Задача 2':
                return lab8_2(text)
            elif selected_function == 'Задача 3':
                return lab8_3(text)
        if selected_module == "Лабораторная 9":
            if selected_function == 'Задача 1':
                return lab9_1(text, 0)
            elif selected_function == 'Задача 2':
                return lab9_2(text, 0)
            elif selected_function == 'Задача 3':
                return lab9_3(text, 0)
            elif selected_function == 'Задача 4':
                return lab9_4(text)
        if selected_module == "Лабораторная 10":
            if selected_function == 'Задача 1':
                return lab10_1(matrix)
            elif selected_function == 'Задача 2':
                return lab10_2(matrix)
            elif selected_function == 'Задача 3':
                return lab10_3(matrix)
            elif selected_function == 'Задача 4':
                return lab10_4(matrix)
            elif selected_function == 'Задача 5':
                return lab10_5(matrix)
            elif selected_function == 'Задача 6':
                return lab10_6(matrix)
            elif selected_function == 'Задача 7':
                return lab10_7(matrix)
            elif selected_function == 'Задача 8':
                return lab10_8(matrix, text)
        ####
        if selected_module == "Лабораторная 11":
            if selected_function == 'Задача 1':
                return lab11_1(flag=1)
            elif selected_function == 'Задача 2':
                return lab11_2(text)
            elif selected_function == 'Задача 3':
                return lab11_3()
            elif selected_function == 'Задача 4':
                return lab11_4()
            elif selected_function == 'Задача 5':
                return lab11_5(text)
        if selected_module == "Лабораторная 12":
            if selected_function == 'Задача 1':
                return lab12_1()
            elif selected_function == 'Задача 2':
                return lab12_2()
            elif selected_function == 'Задача 3':
                return lab12_3()
            elif selected_function == 'Extra':
                return show_db()
        if selected_module == "Лабораторная 13":
            if text == '':
                return 'Вы не ввели текст'
            else:
                if selected_function == 'Задача 1':
                    return lab13_1(text)
                elif selected_function == 'Задача 2':
                    return lab13_2(text)
                elif selected_function == 'Задача 3':
                    return lab13_3(text)
                elif selected_function == 'Задача 4':
                    return lab13_4(text)
                elif selected_function == 'Задача 5':
                    return lab13_5(text)
                elif selected_function == 'Задача 6':
                    return lab13_6(text)
                elif selected_function == 'Задача 7':
                    return lab13_7(text)
                elif selected_function == 'Задача 8':
                    return lab13_8(text)
                elif selected_function == 'Задача 9':
                    return lab13_9(text)
                elif selected_function == 'Задача 10':
                    return lab13_10(text)
                elif selected_function == 'Задача 11':
                    return lab13_11(text)
                elif selected_function == 'Задача 12':
                    return lab13_12(text)
                elif selected_function == 'Задача 13':
                    return lab13_12(text)
        if selected_module == "Лабораторная 14":
            if selected_function == 'Задача 3':
                return lab14_3(text)
            elif selected_function == 'Задача 4':
                return lab14_4(text)
            elif selected_function == 'Задача 5':
                return lab14_5(text)
            elif selected_function == 'Задача 6':
                return lab14_6(text)
        return 'Задачи не существует'
except Exception as e:
    print(e)
