[{"number":"356214","sender":"Линчук А.Н.","comment":"Было бы замечательно, если бы вы предоставили более длительную гарантию на обувь, чтобы покупатели могли быть уверены в качестве продукции. Также предлагаю провести дополнительное обучение сотрудников по технологии изготовления обуви, чтобы улучшить качество производства и избежать дефектов.","id":"1","type":"предложение"},{"number":"621435","sender":"Катарева А.П","comment":"Добрый день! Хотела бы выразить свое недовольство качеством ботинок, произведенных на вашей фабрике. После всего лишь недели использования, подошва начала отклеиваться, что привело к неудобству и даже опасности поскольку я поскользнулась.","id":"2","type":"жалоба"},{"number":"164253","sender":"Райха А.С. \"Шик Обуви\"\"\"","comment":"Здравствуйте, я бы хотела вам предложить улучшить условия обмена и возврата.","id":"3","type":"предложение"},{"number":"614235","sender":"Тыркина С.А.","comment":"Добрый вечер, хотела бы посоветовать вам дополнительное обучение персонала","id":"4","type":"предложение"},{"number":"352146","sender":"Кравец А.И. \"Стильные шаги\"\"\"","comment":"Уважаемые представители обувной фабрики, хотелось бы выразить свою глубокую обеспокоенность качеством поставляемой вашей фабрикой обуви. Недавно мы получили новую партию обуви, и к сожалению, обнаружили ряд серьезных дефектов, таких как отслоение подошвы, неровные швы и скрипучие звуки при ходьбе.\nЭти проблемы вызывают серьезные нарушения в работе нашего магазина и негативно сказываются на репутации нашего бренда. Мы просим вас принять необходимые меры для улучшения качества производства и обеспечения надежности поставок. В противном случае мы прекратим сотрудничество.","id":"5","type":"жалоба"},{"number":"635412","sender":"Крыгин С.А.","comment":"Обновить и дополнить информацию о продукции","id":"6","type":"предложение"},{"number":"435126","sender":"Райха А.С. \"Шик Обуви\"\"\"","comment":"Проблема с обменом и возвратом товара","id":"7","type":"жалоба"},{"number":"652314","sender":"Птыхин О.Г.","comment":"Неадекватная ценовая политика","id":"8","type":"жалоба"},{"number":"526413","sender":"Пташкин Г.С.","comment":"","id":"9","type":"жалоба"},{"number":"512364","sender":"Дьяков Б.О.","comment":"Хочу предложить сократить сроки выполнения заказов и и расширить ассортимент размеров. Спасибо за внимание)","id":"10","type":"предложение"},{"number":"194637","sender":"Бойдорин К.Б","comment":"Уважаемые представители обувной фабрики, мы ценим ваше стремление к качеству и хотели бы предложить сотрудничество в рамках обновления производственных технологий. Мы убеждены, что совместные усилия позволят нам создавать обувь высокого качества, которая будет радовать наших клиентов и способствовать росту обоих наших компаний.\nБудем рады обсудить возможные пути совершенствования производства и внедрения инновационных решений, которые помогут нам достичь общих целей. Надеемся на плодотворное сотрудничество и взаимовыгодное партнерство.\nС уважением, Сыпинин А.О.","id":"11","type":"предложение "},{"number":"235967","sender":"Чихирикин Н.Б.","comment":"Разработать модели обуви с улучшенной посадкой и комфортом.","id":"12","type":"предложение "},{"number":"268397","sender":"Дачкин А.В.","comment":"Расширить ассортимент продукции, включая более разнообразные модели и стили","id":"13","type":"предложение"},{"number":"349281","sender":"Бушембадаева Н.И.","comment":"Качество материалов на обувине соответствует заявленному.","id":"14","type":"жалоба"},{"number":"547632","sender":"Тученка Б.С.","comment":"Плохие материалы ","id":"15","type":"жалоба"},{"number":"222266","sender":"Чорыхин К.М.","comment":"Внедрить экологически чистые технологии производства и продажи обуви.","id":"16","type":"предложение "},{"number":"385169","sender":"Куприн О.М.","comment":"Хочу выразить свое недовольство качеством швов на обуви, приобретеной на вашей фабрике. Несколько пар обуви, которые я приобрел недавно, начали разваливаться на швах после непродолжительного использования. Прошу уделить большее внимание качеству сшивки и использовать более прочные материалы.","id":"17","type":"жалоба"}]